In [1]:
import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

# Series

In [2]:
pd.Series()

Series([], dtype: object)

In [3]:
liste = [1,2,3,4,5]

In [4]:
seri = pd.Series(liste)
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

In [6]:
seri.dtype

dtype('int64')

In [7]:
arr = np.array([1,2,5.6,'array'])
arr

array(['1', '2', '5.6', 'array'], dtype='<U32')

In [9]:
seri = pd.Series([1,2,5.6,'array'])
seri

0        1
1        2
2      5.6
3    array
dtype: object

In [10]:
seri.apply(type)

0      <class 'int'>
1      <class 'int'>
2    <class 'float'>
3      <class 'str'>
dtype: object

In [12]:
seri = pd.Series([1,2,3.7,8.9]).astype(int)
seri

0    1
1    2
2    3
3    8
dtype: int64

In [13]:
seri2 = pd.Series([1,2,3.7,8.9], dtype = 'int32')
seri2 # veri kaybı olacağı için hata verir

ValueError: Trying to coerce float values to integers

In [14]:
seri3 = pd.Series([1,2,3.7,8.9], dtype = str)
seri3

0      1
1      2
2    3.7
3    8.9
dtype: object

In [15]:
seri4 = pd.Series([1,2,3.7,8.9], dtype = float)
seri4

0    1.0
1    2.0
2    3.7
3    8.9
dtype: float64

In [16]:
seri4 = pd.Series([1,2,3.7,8.9])
seri4

0    1.0
1    2.0
2    3.7
3    8.9
dtype: float64

In [18]:
seri = pd.Series([1,2,3],dtype = int)
seri

0    1
1    2
2    3
dtype: int64

In [19]:
seri = pd.Series(data = liste,index = ['a','b','c','d','e'])
seri

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [20]:
seri = pd.Series(data = liste,index = ['a','b','c','d','e','f'])
seri # verdiğimiz index sayisi daha fazla

ValueError: Length of values (5) does not match length of index (6)

# Numpy arrays

In [21]:
arr = np.arange(12).reshape(4,3)
arr

array([[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]])

In [22]:
seri = pd.Series(data = arr)
seri # array direk içine yazamayız

ValueError: Data must be 1-dimensional, got ndarray of shape (4, 3) instead

In [23]:
arr1 = np.arange(5)
arr1

array([0, 1, 2, 3, 4])

In [25]:
seri = pd.Series(arr1)
seri # 1. yöntem

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [26]:
seri = pd.Series(np.arange(5))
seri # 2. yöntem

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [27]:
seri = pd.Series(np.arange(10,50,10), index = [1,2,3,4])
seri

1    10
2    20
3    30
4    40
dtype: int64

In [28]:
seri = pd.Series(np.arange(10,50,10), index = np.arange(1,5))
seri

1    10
2    20
3    30
4    40
dtype: int64

In [29]:
seri = pd.Series(np.arange(10,50,10), index = ['1','2','3','4'])
seri # index i hem tuple hemde liste içinde yazabiliriz

1    10
2    20
3    30
4    40
dtype: int64

In [30]:
seri = pd.Series(np.arange(10,50,10), index = ('1','2','3','4'))
seri # index i hem tuple hemde liste içinde yazabiliriz

1    10
2    20
3    30
4    40
dtype: int64

In [31]:
seri = pd.Series(np.arange(10,50,10), index = (1,2,3,4))
seri

1    10
2    20
3    30
4    40
dtype: int64

# Numpy dict

In [32]:
dict = { 'resim' : 75, 'fen' : 90, 'mat' : 80}

In [33]:
seri = pd.Series(dict)
seri

resim    75
fen      90
mat      80
dtype: int64

In [36]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
dtype: float64

In [37]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','fen'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
fen      90.0
dtype: float64

In [38]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','tarih'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
tarih     NaN
dtype: float64

In [39]:
seri_new = pd.Series(dict, index = ['resim','müzik','mat','fen','resim'])
seri_new
# NaN değerden dolayı dtype : float oldu
# müzik key dict içinde olmadığı için NaN değer döndürdü.

resim    75.0
müzik     NaN
mat      80.0
fen      90.0
resim    75.0
dtype: float64

In [ ]:
#scalar value

In [40]:
pd.Series([10])

0    10
dtype: int64

In [41]:
pd.Series(10, index = [1,2,3])

1    10
2    10
3    10
dtype: int64

In [43]:
pd.Series('pandas')

0    pandas
dtype: object

In [44]:
#Concat

In [45]:
dict

{'resim': 75, 'fen': 90, 'mat': 80}

In [46]:
seri = pd.Series(dict,index = ('x','fen','mat'))
seri

x       NaN
fen    90.0
mat    80.0
dtype: float64

In [47]:
seri2 = pd.concat((seri,seri)) # tuple olarak yazabiliriz
seri2

x       NaN
fen    90.0
mat    80.0
x       NaN
fen    90.0
mat    80.0
dtype: float64

In [48]:
seri2 = pd.concat([seri,seri]) # list olarak yazabiliriz
seri2

x       NaN
fen    90.0
mat    80.0
x       NaN
fen    90.0
mat    80.0
dtype: float64

In [49]:
x = pd.Series([356,357,358])
y = pd.Series(['ahmet','veli','mehmet','mustafa'])
pd.concat((x,y))

0        356
1        357
2        358
0      ahmet
1       veli
2     mehmet
3    mustafa
dtype: object

In [52]:
x = pd.Series([356,357,358])
y = pd.Series(['ahmet','veli','mehmet','mustafa'])
pd.concat((x,y),axis = 1)

       0        1
0  356.0    ahmet
1  357.0     veli
2  358.0   mehmet
3    NaN  mustafa

# indexing ve slicing with pandas serileri

In [53]:
seri = pd.Series([1,2,3,4],index = ["python","git","numpy","pandas"])
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [54]:
seri[3]

np.int64(4)

In [55]:
seri['pandas']

np.int64(4)

In [56]:
seri.index[3]

'pandas'

In [57]:
seri[2]

np.int64(3)

In [58]:
seri[2:]

numpy     3
pandas    4
dtype: int64

In [59]:
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [60]:
seri[1:3]

git      2
numpy    3
dtype: int64

In [62]:
seri[[0,3]] # birden fazla elemanı alırken parantez yazarız

python    1
pandas    4
dtype: int64

In [63]:
seri['git'] # tek parantez ile sadece value dönerken

np.int64(2)

In [64]:
seri[['git']] # tek parantez ile sadece value dönerken

git    2
dtype: int64

In [66]:
seri[['git','pandas']]

git       2
pandas    4
dtype: int64

In [68]:
seri['git':'pandas']
# index label ile slicing yaparken bitiş noktası olan index index label da dahil edilir

git       2
numpy     3
pandas    4
dtype: int64

In [69]:
seri

python    1
git       2
numpy     3
pandas    4
dtype: int64

In [70]:
seri[[0,3,2]]

python    1
pandas    4
numpy     3
dtype: int64

In [71]:
seri[::-1]

pandas    4
numpy     3
git       2
python    1
dtype: int64

# basic attributes ve methods of series

In [72]:
np.random.seed(42)
seri = pd.Series(np.random.randint(0,50,6))
seri

0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32

In [73]:
seri.dtype

dtype('int32')

In [74]:
seri.apply(type)

0    <class 'int'>
1    <class 'int'>
2    <class 'int'>
3    <class 'int'>
4    <class 'int'>
5    <class 'int'>
dtype: object

In [75]:
seri.size

6

In [76]:
seri.ndim

1

In [77]:
seri.index

RangeIndex(start=0, stop=6, step=1)

In [79]:
seri.values

array([38, 28, 14, 42,  7, 20], dtype=int32)

In [78]:
seri.items

<bound method Series.items of 0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32>

In [82]:
list(seri.items())

[(0, 38), (1, 28), (2, 14), (3, 42), (4, 7), (5, 20)]

In [83]:
seri.head() # default ilk 5 değeri döndürdü

0    38
1    28
2    14
3    42
4     7
dtype: int32

In [84]:
seri.head(2)

0    38
1    28
dtype: int32

In [85]:
seri.tail() # default son 5 değeri döndürdü

1    28
2    14
3    42
4     7
5    20
dtype: int32

In [86]:
seri.tail(2)

4     7
5    20
dtype: int32

In [87]:
seri.sample() # rastgele 1 değer döndürdü

5    20
dtype: int32

In [88]:
seri.sample(3)

0    38
1    28
2    14
dtype: int32

In [90]:
seri.sort_index(ascending = True) # default

0    38
1    28
2    14
3    42
4     7
5    20
dtype: int32

In [91]:
seri.sort_index(ascending = False)

5    20
4     7
3    42
2    14
1    28
0    38
dtype: int32

In [92]:
seri.sort_values() #default ascending = True

4     7
2    14
5    20
1    28
0    38
3    42
dtype: int32

In [94]:
seri.sort_values(ascending = False)

3    42
0    38
1    28
5    20
2    14
4     7
dtype: int32

In [95]:
seri.sort_values(ascending = 0)

3    42
0    38
1    28
5    20
2    14
4     7
dtype: int32

In [96]:
seri.sort_values(ascending = 1)

4     7
2    14
5    20
1    28
0    38
3    42
dtype: int32

In [97]:
car_brands = ['Toyota', 'Ford', 'BMW', 'Mercedes', 'Audi', 'Tesla', 'Honda', 'Nissan', 'Chevrolet', 'Hyundai']
seri = pd.Series(car_brands)
seri

0       Toyota
1         Ford
2          BMW
3     Mercedes
4         Audi
5        Tesla
6        Honda
7       Nissan
8    Chevrolet
9      Hyundai
dtype: object

In [98]:
seri.isin(['Toyota','Ford']) # True ve False araması yaptık

0     True
1     True
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [100]:
seri[seri.isin(['Toyota','Ford'])]

0    Toyota
1      Ford
dtype: object

In [101]:
seri.isin([100,200])

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [102]:
seri[seri.isin([100,200])]

Series([], dtype: object)

# DataFrames

In [2]:
data = [[1,2,3],[4,5,6]]
columns = ["A","B","C"]

df = pd.DataFrame(data = data)
df

   0  1  2
0  1  2  3
1  4  5  6

In [4]:
data = [[1,2,3],[4,5,6]]
columns = ["A","B","C"]

df = pd.DataFrame(data = data, columns = columns)
df

   A  B  C
0  1  2  3
1  4  5  6

In [6]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

In [7]:
df.apply(type) # apply sütunların type bilgisini getirdi

A    <class 'pandas.core.series.Series'>
B    <class 'pandas.core.series.Series'>
C    <class 'pandas.core.series.Series'>
dtype: object

In [8]:
df.applymap(type) # applymap ise her bir hücre içindeki valuenun type bilgisini getirdi.

               A              B              C
0  <class 'int'>  <class 'int'>  <class 'int'>
1  <class 'int'>  <class 'int'>  <class 'int'>

# numpy array den data frame oluşturma

In [5]:
arr = np.arange(1,27,3).reshape(3,3)
arr

array([[ 1,  4,  7],
       [10, 13, 16],
       [19, 22, 25]])

In [6]:
df = pd.DataFrame(arr)
df

    0   1   2
0   1   4   7
1  10  13  16
2  19  22  25

In [7]:
df = pd.DataFrame(arr, columns = ['A1','A2','A3'])
df

   A1  A2  A3
0   1   4   7
1  10  13  16
2  19  22  25

In [8]:
df = pd.DataFrame(arr, columns = ['A1','A2','A3'], index = ['B1','B2','B3'])
df

    A1  A2  A3
B1   1   4   7
B2  10  13  16
B3  19  22  25

In [9]:
df = pd.DataFrame(arr,['A1','A2','A3'],['B1','B2','B3']) # columns ve index yazmazsak ilk satır sonra sütun indexi alır
df

    B1  B2  B3
A1   1   4   7
A2  10  13  16
A3  19  22  25

In [10]:
data = {'Name' : ['Zeliha','Mustafa','Ayşenur','Yasemin'], 'Age' : [25,33,28,33]}
df = pd.DataFrame(data)
df
# kayler : columns, value : value

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

# Basic Attributes & Methods of DataFrames

In [12]:
df

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [13]:
df.head() #default ilk 5 değer

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [14]:
df.head(2)

      Name  Age
0   Zeliha   25
1  Mustafa   33

In [15]:
df.tail() #defaultta son 5 değer

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [16]:
df.tail(2)

      Name  Age
2  Ayşenur   28
3  Yasemin   33

In [17]:
df.columns # sütun isimleri

Index(['Name', 'Age'], dtype='object')

In [18]:
df.columns[1] # 1. index sütun ismi

'Age'

In [20]:
df

      Name  Age
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.Age

0    25
1    33
2    28
3    33
Name: Age, dtype: int64

In [23]:
df.Name

0     Zeliha
1    Mustafa
2    Ayşenur
3    Yasemin
Name: Name, dtype: object

In [24]:
df.mean() #string veriler ortalama alınmaz

TypeError: Could not convert ['ZelihaMustafaAyşenurYasemin'] to numeric

In [25]:
df.mean(numeric_only = True)

Age    29.75
dtype: float64

In [27]:
df.Age.mean()

np.float64(29.75)

In [28]:
df.Age.mode() # en çok tekrar eden değeri çıktı olarak verir

0    33
Name: Age, dtype: int64

In [29]:
df.std() # string değerlerin standart sapmasını hesaplayamaz

TypeError: could not convert string to float: 'Zeliha'

In [30]:
df.Age.std()

3.947573094109004

In [31]:
df.std(numeric_only = True)

Age    3.947573
dtype: float64

In [32]:
df.columns

Index(['Name', 'Age'], dtype='object')

In [35]:
df.columns = ['İsim','Yas']
df

      İsim  Yas
0   Zeliha   25
1  Mustafa   33
2  Ayşenur   28
3  Yasemin   33

In [36]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
df.index = ['a','b','c','d']
df

      İsim  Yas
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [38]:
df.rename(columns = {'İsim':'Name','Yas':'Age'}) # kalıcı bir değişiklik yapmaz

      Name  Age
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [39]:
df

      İsim  Yas
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [41]:
df.rename(columns = {'İsim':'Name','Yas':'Age'},inplace = True) # inplace ile kalıcı değişiklik yaptık 
df

      Name  Age
a   Zeliha   25
b  Mustafa   33
c  Ayşenur   28
d  Yasemin   33

In [42]:
df.rename(index = {"a":1, "b":2, "c":3 ,"d":4})

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [43]:
df.rename(index = {"a":1, "b":2, "c":3 ,"d":4}, inplace = True)
# inplace ile kalıcı değişiklik yaptık
df

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [44]:
df.rename(index = {1:'bir',2:'iki',3:'üc',4:'dört'}, columns = {"Name" :"isim", "Age": "yaş"})

         isim  yaş
bir    Zeliha   25
iki   Mustafa   33
üc    Ayşenur   28
dört  Yasemin   33

In [45]:
df.shape

(4, 2)

In [48]:
df.shape[0] # sadece satır sayısını alır

4

In [49]:
df.shape[1] # sadece sütun sayısını alır

2

In [50]:
df.ndim # boyut bilgisi verir

2

In [51]:
df.size # eleman sayısını/value/eleman/entry verir

8

In [52]:
df

      Name  Age
1   Zeliha   25
2  Mustafa   33
3  Ayşenur   28
4  Yasemin   33

In [54]:
'Name' in df # df içinde name varmı? colums ve index label üzerinde arama yapıyor

True

In [53]:
25 in  df

False

In [55]:
'x' in df

False

In [56]:
df.Name == 'Zeliha'

1     True
2    False
3    False
4    False
Name: Name, dtype: bool

In [57]:
df[df.Name == 'Zeliha']

     Name  Age
1  Zeliha   25

In [58]:
df[df.Age == 25]

     Name  Age
1  Zeliha   25

In [59]:
df[df.Age == 33]

      Name  Age
2  Mustafa   33
4  Yasemin   33

# Indexing, Slicing & Selection

In [61]:
data={"isim":["Cem", "Ali", "Ayşe", "Fatma", "Veli","Seda", "Fatih"], "boy-m":[1.78, 1.70,1.60,1.70,1.80,1.65,1.85], "kilo-kg":[75,70, 55, 60, 80,72,83], "yas" : [18,45,25,30,29,35,50]}

In [62]:
df = pd.DataFrame(data,index = ['A','B','C','D','E','F','G'])
df

    isim  boy-m  kilo-kg  yas
A    Cem   1.78       75   18
B    Ali   1.70       70   45
C   Ayşe   1.60       55   25
D  Fatma   1.70       60   30
E   Veli   1.80       80   29
F   Seda   1.65       72   35
G  Fatih   1.85       83   50

In [64]:
df.isim

A      Cem
B      Ali
C     Ayşe
D    Fatma
E     Veli
F     Seda
G    Fatih
Name: isim, dtype: object

In [65]:
df['isim']

A      Cem
B      Ali
C     Ayşe
D    Fatma
E     Veli
F     Seda
G    Fatih
Name: isim, dtype: object

In [66]:
df.kilo-kg # kilo_kg olsaydı kabul ederdi

AttributeError: 'DataFrame' object has no attribute 'kilo'

In [67]:
df.boy-m # boy_m

AttributeError: 'DataFrame' object has no attribute 'boy'

In [68]:
df['kilo-kg']

A    75
B    70
C    55
D    60
E    80
F    72
G    83
Name: kilo-kg, dtype: int64

In [70]:
df['boy-m']

A    1.78
B    1.70
C    1.60
D    1.70
E    1.80
F    1.65
G    1.85
Name: boy-m, dtype: float64

In [69]:
df[['kilo-kg']] #data frame yapısı içinde geldi

   kilo-kg
A       75
B       70
C       55
D       60
E       80
F       72
G       83

In [71]:
df[['kilo-kg','boy-m']] # bişrden fazla sütunu çağırırken sütun Label larını liste içerisinde verdik

   kilo-kg  boy-m
A       75   1.78
B       70   1.70
C       55   1.60
D       60   1.70
E       80   1.80
F       72   1.65
G       83   1.85

In [72]:
# slicing
df[0:2] # 2 dahil değil 0. ve 1. indexli satırları getirdi

  isim  boy-m  kilo-kg  yas
A  Cem   1.78       75   18
B  Ali   1.70       70   45

In [73]:
# index label ile slicing
df['A':'C'] 
# index label kullandığımızda stop noktası dahil oldu. A,B ve C labellı satırlar geldi

   isim  boy-m  kilo-kg  yas
A   Cem   1.78       75   18
B   Ali   1.70       70   45
C  Ayşe   1.60       55   25

In [74]:
df['isim']['B']

'Ali'

In [75]:
df['isim'][1]

'Ali'

In [76]:
df['B']['isim'] #önce sütun girmek lazım

KeyError: 'B'

In [77]:
df['A':'C']

   isim  boy-m  kilo-kg  yas
A   Cem   1.78       75   18
B   Ali   1.70       70   45
C  Ayşe   1.60       55   25

In [78]:
df['A':'C']['isim']

A     Cem
B     Ali
C    Ayşe
Name: isim, dtype: object

In [79]:
df['A':'C'][['isim','yas']] 
# dataframe lerde ikiden fazla sütuna erişmek için liste içerisinde vermemiz gerekiyor

   isim  yas
A   Cem   18
B   Ali   45
C  Ayşe   25

In [82]:
df[['isim','yas']]['A':'C']

   isim  yas
A   Cem   18
B   Ali   45
C  Ayşe   25

In [80]:
df[['isim','yas']]

    isim  yas
A    Cem   18
B    Ali   45
C   Ayşe   25
D  Fatma   30
E   Veli   29
F   Seda   35
G  Fatih   50

# Creating a New Column

In [84]:
# df['yeni_sütun_ismi'] = ...........
df['BMI'] = df['kilo-kg']/(df['boy-m']**2)
df

    isim  boy-m  kilo-kg  yas        BMI
A    Cem   1.78       75   18  23.671254
B    Ali   1.70       70   45  24.221453
C   Ayşe   1.60       55   25  21.484375
D  Fatma   1.70       60   30  20.761246
E   Veli   1.80       80   29  24.691358
F   Seda   1.65       72   35  26.446281
G  Fatih   1.85       83   50  24.251278

In [86]:
# df['yeni_sütun_ismi'] = ...........
df['BMI'] = round(df['kilo-kg']/(df['boy-m']**2)) # yuvarlama
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [87]:
df['new'] = np.arange(1,8)
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

#  Removing Columns & Rows

In [89]:
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [90]:
df.drop('new')
# defaultta axis = 0 = satır olarak çalıştığı için new ismini index label da bulamadı hata verdi

KeyError: "['new'] not found in axis"

In [93]:
df.drop('new',axis = 1) # kalıcı değişiklik yapmadı

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [94]:
df

    isim  boy-m  kilo-kg  yas   BMI  new
A    Cem   1.78       75   18  24.0    1
B    Ali   1.70       70   45  24.0    2
C   Ayşe   1.60       55   25  21.0    3
D  Fatma   1.70       60   30  21.0    4
E   Veli   1.80       80   29  25.0    5
F   Seda   1.65       72   35  26.0    6
G  Fatih   1.85       83   50  24.0    7

In [95]:
df.drop('new',axis = 'columns')

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [96]:
df.drop('new', axis = 1, inplace = True)
df
# yukarıda kalıcı bir değişiklik ile new sütunu silindiği için tekrar çalıştırırsak hata alır

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [97]:
df

    isim  boy-m  kilo-kg  yas   BMI
A    Cem   1.78       75   18  24.0
B    Ali   1.70       70   45  24.0
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [98]:
df.drop(["kilo-kg", "boy-m"], axis = 1) # defaultta inplace = False olduğu için kalıcı değişiklik yapmaz

    isim  yas   BMI
A    Cem   18  24.0
B    Ali   45  24.0
C   Ayşe   25  21.0
D  Fatma   30  21.0
E   Veli   29  25.0
F   Seda   35  26.0
G  Fatih   50  24.0

In [99]:
df.drop(['A','B']) # defaultta axis = 0= satır olduğu için kalıcı değişiklik olmadı

    isim  boy-m  kilo-kg  yas   BMI
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

In [100]:
df.drop(['A','B'],axis = 0)

    isim  boy-m  kilo-kg  yas   BMI
C   Ayşe   1.60       55   25  21.0
D  Fatma   1.70       60   30  21.0
E   Veli   1.80       80   29  25.0
F   Seda   1.65       72   35  26.0
G  Fatih   1.85       83   50  24.0

# Selecting Rows and Columns using .loc[ ] and iloc[ ]

- NOT!!!!!!!!!
- loc[satir label,sutun label,step]
- iloc[satir indexi, sutun indexi, step]

In [102]:
data = np.arange(20).reshape(5,4)
df = pd.DataFrame(data, columns = ['col1','col2','col3','col4'],index = range(1,6))
df

   col1  col2  col3  col4
1     0     1     2     3
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [103]:
df.loc[3] # 3 değerli satırdaki value/entry/değerleri getirdi

col1     8
col2     9
col3    10
col4    11
Name: 3, dtype: int64

In [104]:
df.loc[2:5]

   col1  col2  col3  col4
2     4     5     6     7
3     8     9    10    11
4    12    13    14    15
5    16    17    18    19

In [105]:
df.index = ['a','b','c','d','e']
df
# index label ları değiştirdik

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [106]:
df.loc['b':'e']

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [107]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [108]:
df.iloc[2:5] # iloc klasik defaultta çalışan index numaraları üzerinden çalışır. 0. 1. 2. gibi

   col1  col2  col3  col4
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [109]:
df.loc['b','col2']

np.int64(5)

In [110]:
df.loc['b']

col1    4
col2    5
col3    6
col4    7
Name: b, dtype: int64

In [111]:
df.loc['b']['col2']

np.int64(5)

In [112]:
df.loc[['b'],['col2']]

   col2
b     5

In [113]:
df.iloc[1,1] # iloc[satır index,sütun index]

np.int64(5)

In [114]:
df.iloc[[1,1,2]] # liste içerisinde satır index numaraları verdiğimizde her birisini birer satır olarak çağırır

   col1  col2  col3  col4
b     4     5     6     7
b     4     5     6     7
c     8     9    10    11

In [115]:
df.iloc[[1],[1]]

   col2
b     5

In [116]:
df.loc['b':'d',['col3','col4']] # b satırından başlayıp d satırınıa kadar col3 ve col4 kolonunu getir dedik

   col3  col4
b     6     7
c    10    11
d    14    15

In [117]:
df.loc['b':'d','col1':'col4'] # satır ve sütun slicing ile çıktı aldık

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [118]:
df.loc[['d','b','c']] # liste ile istediğimiz satır labellarını istediğimiz sırada yazdırdık

   col1  col2  col3  col4
d    12    13    14    15
b     4     5     6     7
c     8     9    10    11

In [119]:
df.loc[['d','b','c']][['col3','col1']] # liste ile istediğimiz satır ve sütun labellarını istediğimiz sırada yazdırdık

   col3  col1
d    14    12
b     6     4
c    10     8

In [120]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [121]:
df.iloc[1:4,0] # 1. satır indexsinden 4. satır indexsine kadar (dahil değil), 0. sütun indexsinin kesişimi

b     4
c     8
d    12
Name: col1, dtype: int64

In [122]:
df.iloc[1:4,[0]] # dataframe yapısı

   col1
b     4
c     8
d    12

In [123]:
df.iloc[1:4,[3]]

   col4
b     7
c    11
d    15

In [124]:
df.iloc[1:4]

   col1  col2  col3  col4
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15

In [125]:
df.iloc[1:4]['col4'] # iloctan bağımsız kolan çağrılabilir.
# sütun labelını iloc içerisinden bağımısz oluşan dataframeden çağırdığımız için hata almadan çağırdı

b     7
c    11
d    15
Name: col4, dtype: int64

In [126]:
df.iloc[1:4,'col4'] # iloc label based çalıştığı için içerisinde sütun label yüzünden hata verdi

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

In [127]:
df.loc[:,['col3','col2']]

   col3  col2
a     2     1
b     6     5
c    10     9
d    14    13
e    18    17

In [128]:
df.iloc[:,[2,1]]

   col3  col2
a     2     1
b     6     5
c    10     9
d    14    13
e    18    17

In [129]:
df.loc[['d','e','a']][['col3','col1']]

   col3  col1
d    14    12
e    18    16
a     2     0

In [130]:
df.loc[['col3','col1']][['d','e','a']] # önce satır sonra sütunu aradığı için hata aldık

KeyError: "None of [Index(['col3', 'col1'], dtype='object')] are in the [index]"

In [131]:
df

   col1  col2  col3  col4
a     0     1     2     3
b     4     5     6     7
c     8     9    10    11
d    12    13    14    15
e    16    17    18    19

In [132]:
df.loc[:,'col1':'col4':2] # .loc[bütün satırlar,start label:stop label:step

   col1  col3
a     0     2
b     4     6
c     8    10
d    12    14
e    16    18

In [133]:
df.iloc[:,::2] # iloc[tüm satırlar,başlangıç indexsi : bitiş indexsi : step]

   col1  col3
a     0     2
b     4     6
c     8    10
d    12    14
e    16    18

#  Conditional Selection

In [135]:
# koşul seçerek/ koşula uygun ifadelerin dönmesini sağlayarak seçim yapmak

In [136]:
df = pd.DataFrame(np.random.randn(5,4) , index = 'a b c d e'.split() , columns = ['A','B','C','D'])
df

          A         B         C         D
a  1.789879  1.562768  1.772806 -0.935585
b  0.251713 -0.408699 -0.019895 -0.659717
c -2.153428  0.785733 -0.451706 -1.643336
d  0.617855 -0.073256 -0.989565 -1.344044
e -0.170141 -0.960851 -0.154375 -1.173983

In [137]:
df > 0 # 0 dan büyük olanlar için True döndü

       A      B      C      D
a   True   True   True  False
b   True  False  False  False
c  False   True  False  False
d   True  False  False  False
e  False  False  False  False

In [138]:
df[df > 0]
# koşula uygun olan değerler dataframe üzerinde yazarken False olan koşula uymayan değerler NaN olarak yazıldı

          A         B         C   D
a  1.789879  1.562768  1.772806 NaN
b  0.251713       NaN       NaN NaN
c       NaN  0.785733       NaN NaN
d  0.617855       NaN       NaN NaN
e       NaN       NaN       NaN NaN

In [139]:
df['A'] < 0

a    False
b    False
c     True
d    False
e     True
Name: A, dtype: bool

In [140]:
df[df['A'] < 0]

          A         B         C         D
c -2.153428  0.785733 -0.451706 -1.643336
e -0.170141 -0.960851 -0.154375 -1.173983

In [141]:
df[df['A'] < 0][['A']]

          A
c -2.153428
e -0.170141

In [142]:
df[df['A'] < 0][['B']]  # 0 dan küçük değerlere sahip A sütunu değerlerinin olduğu satırlardaki B sütunu değerlerini çağırdık

          B
c  0.785733
e -0.960851

In [143]:
df

          A         B         C         D
a  1.789879  1.562768  1.772806 -0.935585
b  0.251713 -0.408699 -0.019895 -0.659717
c -2.153428  0.785733 -0.451706 -1.643336
d  0.617855 -0.073256 -0.989565 -1.344044
e -0.170141 -0.960851 -0.154375 -1.173983

In [144]:
df.loc[df['A'] < 0]

          A         B         C         D
c -2.153428  0.785733 -0.451706 -1.643336
e -0.170141 -0.960851 -0.154375 -1.173983

# reset_index() & set_index()

In [3]:
np.random.seed(42)
df = pd.DataFrame(np.random.randn(5,4), index = "a b c d e".split(), columns = ["A","B","C","D"])
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [4]:
df.reset_index() 
# kalıcı değişiklik yapmaz
# label indexleri resetledi default 0,1,... haline getirdi, eski label indexleri sütun haline getirdi

  index         A         B         C         D
0     a  0.496714 -0.138264  0.647689  1.523030
1     b -0.234153 -0.234137  1.579213  0.767435
2     c -0.469474  0.542560 -0.463418 -0.465730
3     d  0.241962 -1.913280 -1.724918 -0.562288
4     e -1.012831  0.314247 -0.908024 -1.412304

In [5]:
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [6]:
df.reset_index(drop = True) # drop  = True parametresi ile eski index labelları düşürdük

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [7]:
df

          A         B         C         D
a  0.496714 -0.138264  0.647689  1.523030
b -0.234153 -0.234137  1.579213  0.767435
c -0.469474  0.542560 -0.463418 -0.465730
d  0.241962 -1.913280 -1.724918 -0.562288
e -1.012831  0.314247 -0.908024 -1.412304

In [8]:
df.reset_index(drop = True, inplace = True)
df
# inplace = True ile kalıcı değişiklik yapıldı

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [9]:
df

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [10]:
df.set_index('C') # C sütununu index label haline getirdi ve sütunlar içerisinden düşürdü
# kalıcı bir değişiklik olmadı

                  A         B         D
C
 0.647689  0.496714 -0.138264  1.523030
 1.579213 -0.234153 -0.234137  0.767435
-0.463418 -0.469474  0.542560 -0.465730
-1.724918  0.241962 -1.913280 -0.562288
-0.908024 -1.012831  0.314247 -1.412304

In [11]:
df

          A         B         C         D
0  0.496714 -0.138264  0.647689  1.523030
1 -0.234153 -0.234137  1.579213  0.767435
2 -0.469474  0.542560 -0.463418 -0.465730
3  0.241962 -1.913280 -1.724918 -0.562288
4 -1.012831  0.314247 -0.908024 -1.412304

In [12]:
df.set_index('C', drop = False) # drop = False ile C sütunu düşürmeden ayrıca index label haline gelmiş oldu

                  A         B         C         D
C
 0.647689  0.496714 -0.138264  0.647689  1.523030
 1.579213 -0.234153 -0.234137  1.579213  0.767435
-0.463418 -0.469474  0.542560 -0.463418 -0.465730
-1.724918  0.241962 -1.913280 -1.724918 -0.562288
-0.908024 -1.012831  0.314247 -0.908024 -1.412304

In [13]:
df.set_index('C', drop = False, inplace = True)
# kalıcı değişiklik yaptık
df

                  A         B         C         D
C
 0.647689  0.496714 -0.138264  0.647689  1.523030
 1.579213 -0.234153 -0.234137  1.579213  0.767435
-0.463418 -0.469474  0.542560 -0.463418 -0.465730
-1.724918  0.241962 -1.913280 -1.724918 -0.562288
-0.908024 -1.012831  0.314247 -0.908024 -1.412304

# Some Useful Methods with Titanic Dataset

In [14]:
import seaborn as sns

In [15]:
sns.__version__

'0.13.2'

In [16]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [17]:
df = sns.load_dataset('titanic')
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [18]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [19]:
df.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [20]:
df.sample(3) # rastgele 3 satır getir

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
321,0,3,male,27.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
70,0,2,male,32.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
209,1,1,male,40.0,0,0,31.0000,C,First,man,True,A,Cherbourg,yes,True

In [21]:
df.shape

(891, 15)

In [22]:
df.info() # data setinin genel değerlendirmesi var

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [23]:
df.info # tek tek sütun üzerinde inceleme yapar

<bound method DataFrame.info of      survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]>

In [24]:
df.describe() # çeşitli istatistiki bilgileri bize çıktı olarak verdi
# describe'ta int ve float olan 6 sütun geldi

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [25]:
df.describe().T # transpoze aldık

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [26]:
df.describe(include = 'number') # defaultta include = number olarak çalışır

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [27]:
df.describe(include = 'all') # tüm data type sütunları getirdi

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
df.describe(include = 'all') # tüm data type sütunları getirdi

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [29]:
df.describe(include = 'category').T

      count unique    top freq
class   891      3  Third  491
deck    203      7      C   59

In [30]:
df.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
248,1,1,male,37.0,1,1,52.5542,S,First,man,True,D,Southampton,yes,False
337,1,1,female,41.0,0,0,134.5000,C,First,woman,False,E,Cherbourg,yes,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True

In [31]:
df.describe(include = 'bool').T

           count unique   top freq
adult_male   891      2  True  537
alone        891      2  True  537

In [32]:
df.describe(exclude = 'number').T # number olmayanları getircek

            count unique          top freq
sex           891      2         male  577
embarked      889      3            S  644
class         891      3        Third  491
who           891      3          man  537
adult_male    891      2         True  537
deck          203      7            C   59
embark_town   889      3  Southampton  644
alive         891      2           no  549
alone         891      2         True  537

In [33]:
df.corr() # string değerlerden dolayı hata

ValueError: could not convert string to float: 'male'

In [34]:
df.corr(numeric_only = True)

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
survived,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307,-0.557080,-0.203367
pclass,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500,0.094035,0.135207
age,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067,0.280328,0.198270
sibsp,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651,-0.253586,-0.584471
parch,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225,-0.349943,-0.583398
fare,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000,-0.182024,-0.271832
adult_male,-0.557080,0.094035,0.280328,-0.253586,-0.349943,-0.182024,1.000000,0.404744
alone,-0.203367,0.135207,0.198270,-0.584471,-0.583398,-0.271832,0.404744,1.000000

In [35]:
df.survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: survived, Length: 891, dtype: int64

In [36]:
df.survived.value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [37]:
df.deck.value_counts()

deck
C    59
B    47
D    33
E    32
A    15
F    13
G     4
Name: count, dtype: int64

In [38]:
df.survived.value_counts()

survived
0    549
1    342
Name: count, dtype: int64

In [39]:
df.survived.value_counts(normalize = True) # normalize = True ile yüzeysel dağılımı çıktı verdi

survived
0    0.616162
1    0.383838
Name: proportion, dtype: float64

In [40]:
# df['sütun_adı'].unique()
df.embark_town.unique() # sütun içerisindeki benzersiz değerleri yazdırır

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)

In [41]:
df.embark_town.nunique() # sütun içindeki kaç adet benzersiz değer olduğu bilgisini getirir

3

In [42]:
# df.sort_values(by = 'sütun ismi',ascending = True) # defaultta ascending True(küçükten büyüğe) sıralama yapar
df.sort_values(by = 'age',ascending = False) 
# ascending = False ile azalan sırada(büyükten küçüğe doğru) by parametresi ile verdiğimiz sütunu sıraladı

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
630,1,1,male,80.0,0,0,30.0000,S,First,man,True,A,Southampton,yes,True
851,0,3,male,74.0,0,0,7.7750,S,Third,man,True,NaN,Southampton,no,True
493,0,1,male,71.0,0,0,49.5042,C,First,man,True,NaN,Cherbourg,no,True
96,0,1,male,71.0,0,0,34.6542,C,First,man,True,A,Cherbourg,no,True
116,0,3,male,70.5,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [43]:
df.age.sort_values(ascending = False)

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [44]:
df['pclass'] == 1 # bileti 1. sınıf olanları döndür

0      False
1       True
2      False
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: pclass, Length: 891, dtype: bool

In [45]:
df[df['pclass'] == 1] # bileti 1. sınıf olan kişilerin bilgisini çektik

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
871,1,1,female,47.0,1,1,52.5542,S,First,woman,False,D,Southampton,yes,False
872,0,1,male,33.0,0,0,5.0000,S,First,man,True,B,Southampton,no,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

In [46]:
first_class = df[df['pclass'] == 1]
first_class.sample(5) # hayatta kalanlardan rastgele 5 kişi seçtik

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
256,1,1,female,NaN,0,0,79.2000,C,First,woman,False,NaN,Cherbourg,yes,True
30,0,1,male,40.0,0,0,27.7208,C,First,man,True,NaN,Cherbourg,no,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True
155,0,1,male,51.0,0,1,61.3792,C,First,man,True,NaN,Cherbourg,no,False

In [47]:
survival_rates = df.groupby('pclass')['survived'].mean()
survival_rates # sınıflara göre hayatta kalanların yüzdesini aldık

pclass
1    0.629630
2    0.472826
3    0.242363
Name: survived, dtype: float64

In [48]:
survival_rates = df.groupby('pclass')['survived'].mean()*100
survival_rates # sınıflara göre hayatta kalanların yüzdesini aldık

pclass
1    62.962963
2    47.282609
3    24.236253
Name: survived, dtype: float64

# Groupby & Aggregation Methods (aggregate() & agg())

groupby(); bir veri setindeki belirli bir sütuna göre gruplama yapmak için kullanılır.

Bu işlev, verileri gruplara ayırmak ve bu gruplar üzerinde çeşitli işlemler yapmak için kullanılır.

Örneğin, bir veri kümesinde müşterilerin isimleri, yaşları ve satın aldıkları ürünler yer alıyor olabilir. groupby() işlevi kullanarak, müşterilerin satın aldıkları ürüne göre gruplandırabilir ve her ürün için ortalama yaşlarını bulabilirsiniz.

Source01, Source02, Source03 Pandas'ın aggregation yöntemleri, belirli bir veri kümesi üzerinde işlemler gerçekleştirerek bir sonuç döndürür.

Bu yöntemler, bir veri kümesindeki değerleri toplama, ortalama alma, en büyük veya en küçük değeri bulma gibi farklı işlemleri gerçekleştirir.

Pandas'ın aggregation yöntemlerinden bazıları şunlardır:

sum(): Belirtilen sütunda yer alan tüm değerlerin toplamını döndürür.

mean(): Belirtilen sütunda yer alan tüm değerlerin ortalamasını döndürür.

median(): Gruplanmış verilerin medyanını hesaplar.

mode() Belirtilen sütunda en çok tekrar eden değerleri döndürür.

max(): Belirtilen sütunda yer alan en büyük değeri döndürür.

min(): Belirtilen sütunda yer alan en küçük değeri döndürür.

count(): Belirtilen sütunda yer alan toplam değer sayısını döndürür.

std(): Belirtilen sütunda yer alan değerlerin standart sapmasını döndürür.

var(): Belirtilen sütunda yer alan değerlerin varyansını döndürür.

describe(): Gruplanmış verilerin istatistiksel özetini hesaplar.

idxmin(): Belirtilen eksen boyunca minimum değeri içeren ilk indeksi döndürür.

idxmax(): Belirtilen eksen boyunca maksimum değeri içeren ilk indeksi döndürür.

corr(): Sütunlar arasındaki korelasyonu, NA/null değerleri hariç tutarak hesaplar.

Bu yöntemler, bir DataFrame veya Series üzerinde kullanılabilir ve istenilen sütun veya satırlarda işlem yapılabilir.

Pandas'ın aggregation yöntemleri, verileri hızlı ve etkili bir şekilde analiz etmek için çok kullanışlıdır.

In [2]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Hatice', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Salary':[180, 160, 150, 180, 240, 200, 220, 160],
        'Experience':[1,3,2,4,8,6,3,1]}

In [3]:
df = pd.DataFrame(data)
df

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3
7  OpenAI         IT    Elif   28     160           1

## Agg

In [51]:
df.agg([sum,min])

,Company,Department,Person,Age,Salary,Experience
sum,AmazonAmazonOpenAIOpenAIAmazonOpenAIAmazonOpenAI,ITHRITHRITHRHRIT,AhmetHaticeFatmaMehmetZeynepAliYusufElif,254,1490,28
min,Amazon,HR,Ahmet,25,150,1

In [52]:
df.agg({'Age' : sum, 'Salary' : min})

Age       254
Salary    150
dtype: int64

In [53]:
df.agg({'Age' : max, 'Salary' : min})

Age        40
Salary    150
dtype: int64

In [54]:
df.agg({'Age' : [max,min], 'Salary' : [min,np.mean]})

       Age  Salary
max   40.0     NaN
min   25.0  150.00
mean   NaN  186.25

In [55]:
df.agg({'Age' : lambda x: x.max() - x.min()})

Age    15
dtype: int64

In [56]:
df.agg({"Department":["nunique","unique","count",]})

        Department
nunique          2
unique    [IT, HR]
count            8

## Groupby

In [4]:
df

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3
7  OpenAI         IT    Elif   28     160           1

In [5]:
df.groupby('Company')

In [6]:
df.groupby('Company')['Salary'].mean()

Company
Amazon    200.0
OpenAI    172.5
Name: Salary, dtype: float64

In [8]:
df.groupby('Company')[['Salary']].mean()

         Salary
Company
Amazon    200.0
OpenAI    172.5

In [7]:
df.groupby('Company').mean() # string değerlerin ortalaması alınamaz

TypeError: agg function failed [how->mean,dtype->object]

In [10]:
df.groupby('Company').mean(numeric_only = True)

           Age  Salary  Experience
Company
Amazon   28.25   200.0        3.75
OpenAI   35.25   172.5        3.25

In [12]:
df.groupby(['Company','Department'])[['Salary']].mean(numeric_only = True)

                    Salary
Company Department
Amazon  HR           190.0
        IT           210.0
OpenAI  HR           190.0
        IT           155.0

In [13]:
df.groupby(['Company','Department']).max()

                    Person  Age  Salary  Experience
Company Department
Amazon  HR           Yusuf   30     220           3
        IT          Zeynep   32     240           8
OpenAI  HR          Mehmet   40     200           6
        IT           Fatma   35     160           2

In [15]:
group = df.groupby('Company')
group.max() # numeric_only = False

        Department  Person  Age  Salary  Experience
Company
Amazon          IT  Zeynep   32     240           8
OpenAI          IT  Mehmet   40     200           6

In [16]:
group = df.groupby('Company')
group.max(numeric_only = True)

         Age  Salary  Experience
Company
Amazon    32     240           8
OpenAI    40     200           6

In [17]:
group.corr() # string değerler nedeniyle hata verir

ValueError: could not convert string to float: 'IT'

In [18]:
group.corr(numeric_only = True)

                         Age    Salary  Experience
Company
Amazon  Age         1.000000 -0.221032   -0.802410
        Salary     -0.221032  1.000000    0.733701
        Experience -0.802410  0.733701    1.000000
OpenAI  Age         1.000000  0.593934    0.794297
        Salary      0.593934  1.000000    0.932203
        Experience  0.794297  0.932203    1.000000

In [19]:
df.groupby('Company').agg([min,max,np.mean]) # string değerlerin ortalaması alınamaz

TypeError: agg function failed [how->mean,dtype->object]

In [20]:
df.groupby('Company').agg([min,max])

        Department     Person         Age     Salary      Experience
               min max    min     max min max    min  max        min max
Company
Amazon          HR  IT  Ahmet  Zeynep  25  32    160  240          1   8
OpenAI          HR  IT    Ali  Mehmet  28  40    150  200          1   6

In [21]:
df.groupby('Company').aggregate([min,max]) # .agg = .aggregate

        Department     Person         Age     Salary      Experience
               min max    min     max min max    min  max        min max
Company
Amazon          HR  IT  Ahmet  Zeynep  25  32    160  240          1   8
OpenAI          HR  IT    Ali  Mehmet  28  40    150  200          1   6

In [22]:
df.groupby('Company').agg({
    'Salary':['min','max','median'],
    'Age' : ['min','median','max'],
    'Experience' : ['min','max']})

        Salary             Age            Experience
           min  max median min median max        min max
Company
Amazon     160  240  200.0  25   28.0  32          1   8
OpenAI     150  200  170.0  28   36.5  40          1   6

In [23]:
df.groupby('Company').agg({
    'Salary':['min','max','median'],
    'Age' : ['min','median','max'],
    'Experience' : ['min','max']}).T

Company            Amazon  OpenAI
Salary     min      160.0   150.0
           max      240.0   200.0
           median   200.0   170.0
Age        min       25.0    28.0
           median    28.0    36.5
           max       32.0    40.0
Experience min        1.0     1.0
           max        8.0     6.0

In [24]:
result = df.groupby(['Company','Department']).agg({
    'Salary' : lambda x: x.sum()*1.1,
    'Experience' : 'mean'})
print(result)

                    Salary  Experience
Company Department
Amazon  HR           418.0         3.0
        IT           462.0         4.5
OpenAI  HR           418.0         5.0
        IT           341.0         1.5

# Useful Operations

## filter() & where()

In [25]:
data = {'Company':['Amazon', 'Amazon', 'OpenAI', 'OpenAI', 'Amazon', 'OpenAI', 'Amazon', 'OpenAI'],
        'Department':['IT', 'HR', 'IT', 'HR', 'IT', 'HR', 'HR', 'IT'],
        'Person':['Ahmet', 'Hatice', 'Fatma', 'Mehmet', 'Zeynep', 'Ali', 'Yusuf', 'Elif'],
        'Age':[32, 26, 35, 40, 25, 38, 30, 28],
        'Salary':[180, 160, 150, 180, 240, 200, 220, 160],
        'Experience':[1,3,2,4,8,6,3,1]}

In [26]:
df = pd.DataFrame(data)
df

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3
7  OpenAI         IT    Elif   28     160           1

### filter

In [27]:
df.filter(['Company','Age'])

  Company  Age
0  Amazon   32
1  Amazon   26
2  OpenAI   35
3  OpenAI   40
4  Amazon   25
5  OpenAI   38
6  Amazon   30
7  OpenAI   28

In [28]:
df.filter(items = [5,2,4], axis = 0)
# axis = 0 satır için axis =1 sütun için kullanılır
# items parametresi ile filter içinde sadece satır veye sütun label ismi üzerinden bir filtreleme yaparız

  Company Department  Person  Age  Salary  Experience
5  OpenAI         HR     Ali   38     200           6
2  OpenAI         IT   Fatma   35     150           2
4  Amazon         IT  Zeynep   25     240           8

In [29]:
df.filter(['Department','Age'])

  Department  Age
0         IT   32
1         HR   26
2         IT   35
3         HR   40
4         IT   25
5         HR   38
6         HR   30
7         IT   28

In [30]:
df.filter(items = ['Department','Age'])

  Department  Age
0         IT   32
1         HR   26
2         IT   35
3         HR   40
4         IT   25
5         HR   38
6         HR   30
7         IT   28

In [32]:
df.filter(like = 'art', axis = 1)
# içinde art geçen sütunları getir

  Department
0         IT
1         HR
2         IT
3         HR
4         IT
5         HR
6         HR
7         IT

In [34]:
df.filter( like = 'ge' , axis = 1) # içinde ge geçen sütunları getir

   Age
0   32
1   26
2   35
3   40
4   25
5   38
6   30
7   28

In [35]:
df.filter(regex = '^S', axis = 1) # S ile başlayan sütunu getir

   Salary
0     180
1     160
2     150
3     180
4     240
5     200
6     220
7     160

In [36]:
df.filter(regex = 'e$', axis = 1) # e ile biten sütunu getir

   Age  Experience
0   32           1
1   26           3
2   35           2
3   40           4
4   25           8
5   38           6
6   30           3
7   28           1

In [37]:
df.groupby('Company')[['Age']].mean()

           Age
Company
Amazon   28.25
OpenAI   35.25

In [39]:
df.groupby('Company').filter(lambda x: x['Age'].mean() < 30)
# her bir şirketin yaş ortalamasını hesaplayarak 30 un altında yaş ortalamasına sahip şirketlerin bilgilerini getirdi.

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
4  Amazon         IT  Zeynep   25     240           8
6  Amazon         HR   Yusuf   30     220           3

In [40]:
df.groupby('Company').filter(lambda x: x['Age'].mean() > 30)
# her bir şirketin yaş ortalamasını hesaplayarak 30 un üstünde yaş ortalamasına sahip şirketlerin bilgilerini getirdi.

  Company Department  Person  Age  Salary  Experience
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
5  OpenAI         HR     Ali   38     200           6
7  OpenAI         IT    Elif   28     160           1

In [43]:
df.groupby('Person').filter(lambda x: (x['Age'] > 30) & (x[x['Salary'] >= 180].shape[0] > 0))

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
3  OpenAI         HR  Mehmet   40     180           4
5  OpenAI         HR     Ali   38     200           6

In [44]:
df[df['Salary'] >= 180]

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3

### where

In [46]:
df

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1  Amazon         HR  Hatice   26     160           3
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4  Amazon         IT  Zeynep   25     240           8
5  OpenAI         HR     Ali   38     200           6
6  Amazon         HR   Yusuf   30     220           3
7  OpenAI         IT    Elif   28     160           1

In [48]:
df.where(df.Age > 30) # koşulu sağlamayan değerleri NaN dönmesini sağladı

  Company Department  Person   Age  Salary  Experience
0  Amazon         IT   Ahmet  32.0   180.0         1.0
1     NaN        NaN     NaN   NaN     NaN         NaN
2  OpenAI         IT   Fatma  35.0   150.0         2.0
3  OpenAI         HR  Mehmet  40.0   180.0         4.0
4     NaN        NaN     NaN   NaN     NaN         NaN
5  OpenAI         HR     Ali  38.0   200.0         6.0
6     NaN        NaN     NaN   NaN     NaN         NaN
7     NaN        NaN     NaN   NaN     NaN         NaN

In [49]:
df.where(df.Age > 30,0)
# NaN değerleri 0 ile doldurulmasını sağladık
# koşulu sağlamayan değerleri 0 dönmesini sağladı

  Company Department  Person  Age  Salary  Experience
0  Amazon         IT   Ahmet   32     180           1
1       0          0       0    0       0           0
2  OpenAI         IT   Fatma   35     150           2
3  OpenAI         HR  Mehmet   40     180           4
4       0          0       0    0       0           0
5  OpenAI         HR     Ali   38     200           6
6       0          0       0    0       0           0
7       0          0       0    0       0           0

In [50]:
df.groupby('Company')[['Salary']].mean()

         Salary
Company
Amazon    200.0
OpenAI    172.5

In [51]:
df.groupby('Company')['Salary'].agg('mean')

Company
Amazon    200.0
OpenAI    172.5
Name: Salary, dtype: float64

In [56]:
df['Salary_Level'] = np.where(df['Salary'] > df.groupby('Company')['Salary'].transform('mean'), 'Hight', 'Low')
df
# np where de koşulu sağlarsa şunu sağlamazsa bunu yaz gibi bir kod yazabiliriz

  Company Department  Person  Age  Salary  Experience Salary_Level
0  Amazon         IT   Ahmet   32     180           1          Low
1  Amazon         HR  Hatice   26     160           3          Low
2  OpenAI         IT   Fatma   35     150           2          Low
3  OpenAI         HR  Mehmet   40     180           4        Hight
4  Amazon         IT  Zeynep   25     240           8        Hight
5  OpenAI         HR     Ali   38     200           6        Hight
6  Amazon         HR   Yusuf   30     220           3        Hight
7  OpenAI         IT    Elif   28     160           1          Low

## transform()

In [57]:
df

  Company Department  Person  Age  Salary  Experience Salary_Level
0  Amazon         IT   Ahmet   32     180           1          Low
1  Amazon         HR  Hatice   26     160           3          Low
2  OpenAI         IT   Fatma   35     150           2          Low
3  OpenAI         HR  Mehmet   40     180           4        Hight
4  Amazon         IT  Zeynep   25     240           8        Hight
5  OpenAI         HR     Ali   38     200           6        Hight
6  Amazon         HR   Yusuf   30     220           3        Hight
7  OpenAI         IT    Elif   28     160           1          Low

In [58]:
df_num = df.select_dtypes(include = 'number')
df_num

   Age  Salary  Experience
0   32     180           1
1   26     160           3
2   35     150           2
3   40     180           4
4   25     240           8
5   38     200           6
6   30     220           3
7   28     160           1

In [60]:
df_str = df.select_dtypes(include = 'object')
df_str

  Company Department  Person Salary_Level
0  Amazon         IT   Ahmet          Low
1  Amazon         HR  Hatice          Low
2  OpenAI         IT   Fatma          Low
3  OpenAI         HR  Mehmet        Hight
4  Amazon         IT  Zeynep        Hight
5  OpenAI         HR     Ali        Hight
6  Amazon         HR   Yusuf        Hight
7  OpenAI         IT    Elif          Low

In [62]:
df_num.Salary.transform(np.sqrt)
# Karakökünü aldı her bir değerin. Yeni bir seri olarak yazdırdı

0    13.416408
1    12.649111
2    12.247449
3    13.416408
4    15.491933
5    14.142136
6    14.832397
7    12.649111
Name: Salary, dtype: float64

In [64]:
df.groupby('Company')['Age'].agg('mean')

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [65]:
df.groupby('Company')['Age'].transform('mean')

0    28.25
1    28.25
2    35.25
3    35.25
4    28.25
5    35.25
6    28.25
7    35.25
Name: Age, dtype: float64

## apply() & applymap() & map()

In [66]:
days = pd.Series(['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun'])
day_map = {
    'Mon': 'Monday',
    'Tue': 'Tuesday',
    'Wed': 'Wednesday',
    'Thu': 'Thursday',
    'Fri': 'Friday',
    'Sat': 'Saturday',
    'Sun': 'Sunday'
}
days_mapped = days.map(day_map)
print(days_mapped)

0       Monday
1      Tuesday
2    Wednesday
3     Thursday
4       Friday
5     Saturday
6       Sunday
dtype: object

In [67]:
df_num

   Age  Salary  Experience
0   32     180           1
1   26     160           3
2   35     150           2
3   40     180           4
4   25     240           8
5   38     200           6
6   30     220           3
7   28     160           1

In [69]:
df_num.apply(np.mean) # axis = 0 iken sütun üzerinden bir işlem yaptı. sütunların ortalama bilgisini aldık.

Age            31.75
Salary        186.25
Experience      3.50
dtype: float64

In [71]:
df_num.applymap(np.mean) # axis = 0 iken sütun üzerinden bir işlem yaptı.

    Age  Salary  Experience
0  32.0   180.0         1.0
1  26.0   160.0         3.0
2  35.0   150.0         2.0
3  40.0   180.0         4.0
4  25.0   240.0         8.0
5  38.0   200.0         6.0
6  30.0   220.0         3.0
7  28.0   160.0         1.0

In [73]:
df_num.apply(sum)

Age            254
Salary        1490
Experience      28
dtype: int64

In [76]:
df_num.applymap(sum)  #her bir öğeye işlem uyguladığı için iterable nesne yüzünden hata verdi

TypeError: 'int' object is not iterable

In [77]:
df_num.applymap(np.sqrt) # her bir değere karakök alma işlemi yaptı

        Age     Salary  Experience
0  5.656854  13.416408    1.000000
1  5.099020  12.649111    1.732051
2  5.916080  12.247449    1.414214
3  6.324555  13.416408    2.000000
4  5.000000  15.491933    2.828427
5  6.164414  14.142136    2.449490
6  5.477226  14.832397    1.732051
7  5.291503  12.649111    1.000000

In [79]:
df_num.apply(lambda x: x.sum(), axis = 0)
# axis = 0 ile sütun bazında işlem yaparak fonksiyonu sütunlara uyguladı

Age            254
Salary        1490
Experience      28
dtype: int64

In [80]:
df_num.apply(lambda x: x.sum(), axis = 1)
# axis = 1 ile satır bazında işlem yaparak fonksiyonu sütunlara uyguladı

0    213
1    189
2    187
3    224
4    273
5    244
6    253
7    189
dtype: int64

In [81]:
df_num.apply(lambda x: x*10, axis = 1) 
# satır boyunca 10 ile çarpma işlemi gerçekleştirdi

   Age  Salary  Experience
0  320    1800          10
1  260    1600          30
2  350    1500          20
3  400    1800          40
4  250    2400          80
5  380    2000          60
6  300    2200          30
7  280    1600          10

In [82]:
df_num.apply(lambda x: x*10, axis = 0) 
# sütun boyunca 10 ile çarpma işlemi gerçekleştirdi

   Age  Salary  Experience
0  320    1800          10
1  260    1600          30
2  350    1500          20
3  400    1800          40
4  250    2400          80
5  380    2000          60
6  300    2200          30
7  280    1600          10

In [83]:
df.groupby('Company')['Age']

In [85]:
df.groupby('Company')[['Age']]

In [86]:
df.groupby('Company')['Age'].agg('mean')

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [87]:
df.groupby('Company')['Age'].transform('mean')

0    28.25
1    28.25
2    35.25
3    35.25
4    28.25
5    35.25
6    28.25
7    35.25
Name: Age, dtype: float64

In [88]:
df.groupby('Company')['Age'].apply('mean')

Company
Amazon    28.25
OpenAI    35.25
Name: Age, dtype: float64

In [89]:
df.groupby('Company')[['Age']].applymap('mean')
# dataFrame yapısı dönmeli group objesinin değil o yüzden hata verdi

AttributeError: 'DataFrameGroupBy' object has no attribute 'applymap'

In [90]:
df['Person']

0     Ahmet
1    Hatice
2     Fatma
3    Mehmet
4    Zeynep
5       Ali
6     Yusuf
7      Elif
Name: Person, dtype: object

In [92]:
df[['Person']].applymap(lambda x: x.lower())

   Person
0   ahmet
1  hatice
2   fatma
3  mehmet
4  zeynep
5     ali
6   yusuf
7    elif

In [93]:
df[['Salary']].applymap(lambda x: x * 1.25)

   Salary
0   225.0
1   200.0
2   187.5
3   225.0
4   300.0
5   250.0
6   275.0
7   200.0

In [94]:
df.Department

0    IT
1    HR
2    IT
3    HR
4    IT
5    HR
6    HR
7    IT
Name: Department, dtype: object

In [95]:
df.Department.map({ 'IT' : 0, 'HR' : 1})

0    0
1    1
2    0
3    1
4    0
5    1
6    1
7    0
Name: Department, dtype: int64

## pivot() vs pivot_table()

In [96]:
data = {'gender':['male', 'female', 'female', 'male', 'female', 'male'],
        'sport':['tennis', 'tennis', 'basketball', 'football', 'voleyball', 'basketball'],
        'status':["professional","professional","professional","amateur","amateur","amateur"],
        'age':[20, 24, 26, 23, 22, 21],
        'height':[185, 172, 175, 178, 182, 196],
        'weight':[83, 58, 62, 80, 65, 90]}
df = pd.DataFrame(data)

In [97]:
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [99]:
df.pivot(index ='gender', columns = 'sport', values = 'age')
# her bir spor dalında yarışan erkek ve kadın sporcuların yaşını gösteren dataframe oluşturuldu.
# NaN değerler olduğunda integer olan verilerimiz float haline dönüşür.

sport   basketball  football  tennis  voleyball
gender
female        26.0       NaN    24.0       22.0
male          21.0      23.0    20.0        NaN

In [100]:
df.pivot(index = 'gender', columns = 'sport', values = ['age'])

              age
sport  basketball football tennis voleyball
gender
female       26.0      NaN   24.0      22.0
male         21.0     23.0   20.0       NaN

In [101]:
df.pivot(index = 'gender', columns = 'sport', values = ['age','height','weight'])

              age                               height                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female       26.0      NaN   24.0      22.0      175.0      NaN  172.0
male         21.0     23.0   20.0       NaN      196.0    178.0  185.0

                     weight
sport  voleyball basketball football tennis voleyball
gender
female     182.0       62.0      NaN   58.0      65.0
male         NaN       90.0     80.0   83.0       NaN

In [102]:
df.pivot(index = 'gender', columns = 'sport', values = ['age','height','weight']).T

gender             female   male
       sport
age    basketball    26.0   21.0
       football       NaN   23.0
       tennis        24.0   20.0
       voleyball     22.0    NaN
height basketball   175.0  196.0
       football       NaN  178.0
       tennis       172.0  185.0
       voleyball    182.0    NaN
weight basketball    62.0   90.0
       football       NaN   80.0
       tennis        58.0   83.0
       voleyball     65.0    NaN

In [103]:
df.pivot(index = 'gender', columns = 'sport', values = 'status')

sport     basketball football        tennis voleyball
gender
female  professional      NaN  professional   amateur
male         amateur  amateur  professional       NaN

In [104]:
df.pivot(index = 'gender', columns = 'sport', values = 'status').T

gender            female          male
sport
basketball  professional       amateur
football             NaN       amateur
tennis      professional  professional
voleyball        amateur           NaN

In [105]:
df.pivot_table(index = 'gender', columns = 'status', values = 'sport')
# default aggfunc = mean olduğu için string olan sport sütunu değerleri ile hesaplama yapamayacağı için hata verdi

TypeError: agg function failed [how->mean,dtype->object]

In [106]:
df.pivot_table(index = 'gender', columns = 'status', values = 'sport',aggfunc = 'count')

status  amateur  professional
gender
female        1             2
male          2             1

In [107]:
df.pivot(index = 'gender', columns = 'status', values = 'sport')
# tekrarlı veri olduğu için hata verdi

ValueError: Index contains duplicate entries, cannot reshape

In [108]:
df

   gender       sport        status  age  height  weight
0    male      tennis  professional   20     185      83
1  female      tennis  professional   24     172      58
2  female  basketball  professional   26     175      62
3    male    football       amateur   23     178      80
4  female   voleyball       amateur   22     182      65
5    male  basketball       amateur   21     196      90

In [109]:
df.iloc[2][1]

'basketball'

In [110]:
df.iloc[2,1]

'basketball'

In [111]:
df.loc[2,'sport']

'basketball'

In [112]:
df.iloc[2,1] = 'tennis'

In [113]:
df.pivot(index = 'gender', columns = 'sport', values = 'age')
# dublicate verilerin varliğinda hata verir iki adet kadın tenisçi olduğu için hata verdi

ValueError: Index contains duplicate entries, cannot reshape

In [114]:
df.pivot_table(index = 'gender', columns = 'sport', values = 'age')
# iki adet kadın tenisçilerin yaşları 24 ve 26 bilgisini default aggfunc = mean olduğu için 25 olarak yazdı

sport   basketball  football  tennis  voleyball
gender
female         NaN       NaN    25.0       22.0
male          21.0      23.0    20.0        NaN

In [115]:
df.pivot_table(index = 'gender', columns = 'sport', values = 'age', aggfunc = 'min')
# min olduğu için kadın tenisçi yaş 24 oldu

sport   basketball  football  tennis  voleyball
gender
female         NaN       NaN    24.0       22.0
male          21.0      23.0    20.0        NaN

In [116]:
df.pivot_table(index = 'gender', columns = 'sport', values = 'age', aggfunc = ['count','max'])

            count                                  max                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female        NaN      NaN    2.0       1.0        NaN      NaN   26.0
male          1.0      1.0    1.0       NaN       21.0     23.0   20.0


sport  voleyball
gender
female      22.0
male         NaN

In [117]:
df.pivot_table(index = 'gender', columns = 'sport', values = 'age', aggfunc = ['count','max']).T

gender            female  male
      sport
count basketball     NaN   1.0
      football       NaN   1.0
      tennis         2.0   1.0
      voleyball      1.0   NaN
max   basketball     NaN  21.0
      football       NaN  23.0
      tennis        26.0  20.0
      voleyball     22.0   NaN

In [118]:
df.pivot_table(index = "gender", columns = "sport", values = "age", aggfunc = ["count","max"], fill_value = 0)
# fill_value = 0 ile NaN yerine 0 yazılmasını sağladı,  istediğimiz değerin yazmasını sağlayabiliriz bu parametre ile

            count                                  max                  \
sport  basketball football tennis voleyball basketball football tennis
gender
female          0        0      2         1          0        0     26
male            1        1      1         0         21       23     20


sport  voleyball
gender
female        22
male           0

# Missing Values

## Type of NaN Values

In [92]:
id_no = ["P001", "P002", "P003", "P004", "P005", "P006", "P007", "P008", "P009", "P010", "P011"]
gender = ["M", "F", "M", "F", "M", "F", "M", "F", "M", "F", "M"]
status = ["FT", "PT", "-", "FT", "PT", "PT", "FT", "-", "PT", "FT", np.nan]
dept = ["DS", "FS", "AWS", "AWS", "DS", None, "FS", "FS", np.nan, "DS", "AWS"]
experience = np.array([2, 3, 5, None, 7, 1, None, 10, 14, "-", 6])
score = np.array([8, np.nan, 5, 8, 11, np.nan, np.nan, 2, 3, 7, 9])
salary = np.array([np.nan, 54, 59, 120, 58, 75, None, 136, 60, 125, np.nan])

df0 = pd.DataFrame({
                   "id" : id_no,
                   "gender": gender,
                   "status": status,
                   "dept": dept,
                   "exp" : experience,
                   "score" : score,
                   "salary" : salary
                  })

In [93]:
# MCAR : missing completely at random
# MAR : Missing at random
# MNAR : Missing not a random

In [94]:
df0

      id gender status  dept   exp  score salary
0   P001      M     FT    DS     2    8.0    NaN
1   P002      F     PT    FS     3    NaN     54
2   P003      M      -   AWS     5    5.0     59
3   P004      F     FT   AWS  None    8.0    120
4   P005      M     PT    DS     7   11.0     58
5   P006      F     PT  None     1    NaN     75
6   P007      M     FT    FS  None    NaN   None
7   P008      F      -    FS    10    2.0    136
8   P009      M     PT   NaN    14    3.0     60
9   P010      F     FT    DS     -    7.0    125
10  P011      M    NaN   AWS     6    9.0    NaN

In [95]:
df = df0.copy()
df

      id gender status  dept   exp  score salary
0   P001      M     FT    DS     2    8.0    NaN
1   P002      F     PT    FS     3    NaN     54
2   P003      M      -   AWS     5    5.0     59
3   P004      F     FT   AWS  None    8.0    120
4   P005      M     PT    DS     7   11.0     58
5   P006      F     PT  None     1    NaN     75
6   P007      M     FT    FS  None    NaN   None
7   P008      F      -    FS    10    2.0    136
8   P009      M     PT   NaN    14    3.0     60
9   P010      F     FT    DS     -    7.0    125
10  P011      M    NaN   AWS     6    9.0    NaN

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      11 non-null     object
 1   gender  11 non-null     object
 2   status  10 non-null     object
 3   dept    9 non-null      object
 4   exp     9 non-null      object
 5   score   8 non-null      float64
 6   salary  8 non-null      object
dtypes: float64(1), object(6)
memory usage: 748.0+ bytes

In [45]:
type(np.nan)

float

In [46]:
type(np.NaN) 
# eskiden np.NaN vardı artık kullanılmıyor hata veriyor yerine np.nan kullanılması gerekiyor

AttributeError: `np.NaN` was removed in the NumPy 2.0 release. Use `np.nan` instead.

In [47]:
type(None)

NoneType

In [48]:
# nan değerin olduğu integer değerler varlığında dtype float olur
pd.Series([1, np.nan, 3, np.nan, 5])

0    1.0
1    NaN
2    3.0
3    NaN
4    5.0
dtype: float64

In [49]:
print("1", 0 * np.nan) # = nan
print("2", np.nan - np.nan) # = nan
print("3", np.nan + np.nan) # = nan
print("4", np.nan - 10) # = nan
print("5", np.nan + 10) # = nan
print("6", np.nan == np.nan)  # = False   değer olarak eşit değil. çünkü belirsiz.
print("7", 10 > np.nan) # = False
print("8", np.inf > np.nan)  # = False değeri belirsiz olduğu için
# sonsuz > nan diye sorguladığımızda bile false veriyor
print(
    "9", float("-inf") < np.nan < float("inf") # = False
)  # nan, eksi sonsuz ile artı sonsuz arasına düşen bir değer de değildir.
print("10", np.nan is np.nan)  # is ile sorgulama yaptığınızda id değerlerini yani;  NaN nesnesinin hafızada aynı yeri işaret edip etmediğini kontrol eder.
# memory location'ını sorgulamış olursunuz ki bu değerler aynıdır.
# Fakat bu; value'ları aynı demek değildir.

1 nan
2 nan
3 nan
4 nan
5 nan
6 False
7 False
8 False
9 False
10 True

In [50]:
id(np.nan)

1645333753744

In [51]:
id(None)

140728351197312

## Detecting Missing Values

In [52]:
df

      id gender status  dept   exp  score salary
0   P001      M     FT    DS     2    8.0    NaN
1   P002      F     PT    FS     3    NaN     54
2   P003      M      -   AWS     5    5.0     59
3   P004      F     FT   AWS  None    8.0    120
4   P005      M     PT    DS     7   11.0     58
5   P006      F     PT  None     1    NaN     75
6   P007      M     FT    FS  None    NaN   None
7   P008      F      -    FS    10    2.0    136
8   P009      M     PT   NaN    14    3.0     60
9   P010      F     FT    DS     -    7.0    125
10  P011      M    NaN   AWS     6    9.0    NaN

In [53]:
df.isnull() # nan olan değerler True dolu olan değerlere False yazar
# null: boş değer

       id  gender  status   dept    exp  score  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False   True  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False   True   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [54]:
df.isnull().sum() # nan değerlerin sütun bazında kaç tane olduğunu gösterir.

id        0
gender    0
status    1
dept      2
exp       2
score     3
salary    3
dtype: int64

In [55]:
df.isna()
# nan olan değerler True dolu olan değerlere False yazar
# null: boş değer

       id  gender  status   dept    exp  score  salary
0   False   False   False  False  False  False    True
1   False   False   False  False  False   True   False
2   False   False   False  False  False  False   False
3   False   False   False  False   True  False   False
4   False   False   False  False  False  False   False
5   False   False   False   True  False   True   False
6   False   False   False  False   True   True    True
7   False   False   False  False  False  False   False
8   False   False   False   True  False  False   False
9   False   False   False  False  False  False   False
10  False   False    True  False  False  False    True

In [56]:
df.isna().sum() # nan değerlerin sütun bazında kaç tane olduğunu gösterir.

id        0
gender    0
status    1
dept      2
exp       2
score     3
salary    3
dtype: int64

In [57]:
df.notnull() # boş değerlere False dolu değerlere True koyar

      id  gender  status   dept    exp  score  salary
0   True    True    True   True   True   True   False
1   True    True    True   True   True  False    True
2   True    True    True   True   True   True    True
3   True    True    True   True  False   True    True
4   True    True    True   True   True   True    True
5   True    True    True  False   True  False    True
6   True    True    True   True  False  False   False
7   True    True    True   True   True   True    True
8   True    True    True  False   True   True    True
9   True    True    True   True   True   True    True
10  True    True   False   True   True   True   False

In [58]:
df.notnull().sum() # sütun bazında True değerlerin sayısını doldurur.

id        11
gender    11
status    10
dept       9
exp        9
score      8
salary     8
dtype: int64

In [59]:
df.notna() # boş değerlere False dolu değerlere True koyar

      id  gender  status   dept    exp  score  salary
0   True    True    True   True   True   True   False
1   True    True    True   True   True  False    True
2   True    True    True   True   True   True    True
3   True    True    True   True  False   True    True
4   True    True    True   True   True   True    True
5   True    True    True  False   True  False    True
6   True    True    True   True  False  False   False
7   True    True    True   True   True   True    True
8   True    True    True  False   True   True    True
9   True    True    True   True   True   True    True
10  True    True   False   True   True   True   False

In [60]:
df.notna().sum() # sütun bazında True değerlerin sayısını doldurur.

id        11
gender    11
status    10
dept       9
exp        9
score      8
salary     8
dtype: int64

In [61]:
df.isnull().sum().sum() # satır ve sütun toplamında kaç nan değer var onu bulduk

np.int64(11)

In [62]:
df.salary.isnull().sum() # salary sütununda kaç boş değer var ona baktık

np.int64(3)

In [63]:
df.salary.notnull().sum() # salary de dolu değer sayısını döndürdük

np.int64(8)

In [64]:
df.salary.isna().sum()

np.int64(3)

In [65]:
df.salary.notna().sum()

np.int64(8)

In [66]:
df.isnull().any() 
# herhagi bir nan değer olup olmadığını sorgular, nan değer varsa True yoksa False döner , defaultta axis = 0 çalışır
# axis = 0 default olarak çalışıyor
# sütun bazında boş değer varmı yoksa False varsa True döner

id        False
gender    False
status     True
dept       True
exp        True
score      True
salary     True
dtype: bool

In [67]:
df.isnull().any(axis = 1) 
# herhagi bir nan değer olup olmadığını sorgular, nan değer varsa True yoksa False döner , axis = 1 satır bazlı çalışır
# axis = 0 default olarak çalışıyor axis = 1 olunca satırlara bakıyor
# satır bazında boş değer varmı yoksa False varsa True döner

0      True
1      True
2     False
3      True
4     False
5      True
6      True
7     False
8      True
9     False
10     True
dtype: bool

In [68]:
df[df.isnull().any(axis = 1)] # içinde nan olan satırı gösterdi

      id gender status  dept   exp  score salary
0   P001      M     FT    DS     2    8.0    NaN
1   P002      F     PT    FS     3    NaN     54
3   P004      F     FT   AWS  None    8.0    120
5   P006      F     PT  None     1    NaN     75
6   P007      M     FT    FS  None    NaN   None
8   P009      M     PT   NaN    14    3.0     60
10  P011      M    NaN   AWS     6    9.0    NaN

In [69]:
df[~df.isnull().any(axis = 1)] # ~ ile içinde nan olmayanları döndürdü.

     id gender status dept exp  score salary
2  P003      M      -  AWS   5    5.0     59
4  P005      M     PT   DS   7   11.0     58
7  P008      F      -   FS  10    2.0    136
9  P010      F     FT   DS   -    7.0    125

## Converting Improper Values to NaN Values

In [84]:
df

      id gender status  dept   exp  score salary
0   P001      M     FT    DS     2    8.0    NaN
1   P002      F     PT    FS     3    NaN     54
2   P003      M      -   AWS     5    5.0     59
3   P004      F     FT   AWS  None    8.0    120
4   P005      M     PT    DS     7   11.0     58
5   P006      F     PT  None     1    NaN     75
6   P007      M     FT    FS  None    NaN   None
7   P008      F      -    FS    10    2.0    136
8   P009      M     PT   NaN    14    3.0     60
9   P010      F     FT    DS     -    7.0    125
10  P011      M    NaN   AWS     6    9.0    NaN

In [96]:
df['exp']

0        2
1        3
2        5
3     None
4        7
5        1
6     None
7       10
8       14
9        -
10       6
Name: exp, dtype: object

In [86]:
df['status']

0      FT
1      PT
2       -
3      FT
4      PT
5      PT
6      FT
7       -
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [102]:
df['status'] = df['status'].replace('-',np.nan)
df['status']

0      FT
1      PT
2     NaN
3      FT
4      PT
5      PT
6      FT
7     NaN
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [97]:
df['exp'].replace(to_replace = '-', value = np.nan , inplace = False) 
# kalıcı değişiklik yapmaz

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: exp, dtype: float64

In [98]:
df['exp'].replace(to_replace = '-', value = np.nan , inplace = True) 
# kalıcı değişiklik yaptı.

In [99]:
df['exp']

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: exp, dtype: float64

In [103]:
df.isnull().sum().sum()

np.int64(14)

In [101]:
df0.isnull().sum().sum() # orjinal verideki3 adet - , nan değer olarak değiştirdiğimiz için 3 eksik nan çıkıyor

np.int64(11)

## Missing Value Handling Methods

In [104]:
df.dropna(axis = 0, how = 'any' , inplace = False)
# how = 'any' (default) bir tane bile nan değer varsa düşür
# axis = 0 ile satır bazında işlem yaptı
# sadece 4. satırda nan değer olmadığı için diğerlerini düşürdü

     id gender status dept  exp  score salary
4  P005      M     PT   DS  7.0   11.0     58

In [105]:
df.dropna(axis = 0, how = 'all' , inplace = False)
# how = all ile hepsi nan olan satır varsa düşür dedik, 
# hepsi nan olan satır olmadığı için hiç bir düşürme yapmayıp df'in son halini yazdırdı
# axis = 0 ile satır bazında işlem yaptı

      id gender status  dept   exp  score salary
0   P001      M     FT    DS   2.0    8.0    NaN
1   P002      F     PT    FS   3.0    NaN     54
2   P003      M    NaN   AWS   5.0    5.0     59
3   P004      F     FT   AWS   NaN    8.0    120
4   P005      M     PT    DS   7.0   11.0     58
5   P006      F     PT  None   1.0    NaN     75
6   P007      M     FT    FS   NaN    NaN   None
7   P008      F    NaN    FS  10.0    2.0    136
8   P009      M     PT   NaN  14.0    3.0     60
9   P010      F     FT    DS   NaN    7.0    125
10  P011      M    NaN   AWS   6.0    9.0    NaN

In [106]:
df.dropna(axis = 1, how = 'any' , inplace = False)
# her hangibir nan değer olan sütunların düşürülmesini sağladı sadece tamamı dolu olan sütunlar kaldı geriye

      id gender
0   P001      M
1   P002      F
2   P003      M
3   P004      F
4   P005      M
5   P006      F
6   P007      M
7   P008      F
8   P009      M
9   P010      F
10  P011      M

In [107]:
df.dropna(axis = 1, how = 'all' , inplace = False)
# hepsi nan olan sütun olmadığı için bütün sütunlar kaldı hiç bir sütun düşürmedi

      id gender status  dept   exp  score salary
0   P001      M     FT    DS   2.0    8.0    NaN
1   P002      F     PT    FS   3.0    NaN     54
2   P003      M    NaN   AWS   5.0    5.0     59
3   P004      F     FT   AWS   NaN    8.0    120
4   P005      M     PT    DS   7.0   11.0     58
5   P006      F     PT  None   1.0    NaN     75
6   P007      M     FT    FS   NaN    NaN   None
7   P008      F    NaN    FS  10.0    2.0    136
8   P009      M     PT   NaN  14.0    3.0     60
9   P010      F     FT    DS   NaN    7.0    125
10  P011      M    NaN   AWS   6.0    9.0    NaN

In [108]:
df.drop([1,3,5,7,9]) 
# deafult axis = 0 olduğu için 1,3,5,7,9, label lı satırlar düşürüldü.
# verdiğimiz satırları sildi

      id gender status dept   exp  score salary
0   P001      M     FT   DS   2.0    8.0    NaN
2   P003      M    NaN  AWS   5.0    5.0     59
4   P005      M     PT   DS   7.0   11.0     58
6   P007      M     FT   FS   NaN    NaN   None
8   P009      M     PT  NaN  14.0    3.0     60
10  P011      M    NaN  AWS   6.0    9.0    NaN

In [109]:
df.drop(['exp','score']) # axis = 1 demediğimiz için defaultta axis = 0 olduğu için sütun isimlerini satırda aradı hata verdi

KeyError: "['exp', 'score'] not found in axis"

In [110]:
df.drop(['exp','score'],axis = 1)

      id gender status  dept salary
0   P001      M     FT    DS    NaN
1   P002      F     PT    FS     54
2   P003      M    NaN   AWS     59
3   P004      F     FT   AWS    120
4   P005      M     PT    DS     58
5   P006      F     PT  None     75
6   P007      M     FT    FS   None
7   P008      F    NaN    FS    136
8   P009      M     PT   NaN     60
9   P010      F     FT    DS    125
10  P011      M    NaN   AWS    NaN

In [112]:
df # inplace = True kullansaydık yaptığımız değişiklikler kalıcı olucaktı ama şuan df tam olarak geldi

      id gender status  dept   exp  score salary
0   P001      M     FT    DS   2.0    8.0    NaN
1   P002      F     PT    FS   3.0    NaN     54
2   P003      M    NaN   AWS   5.0    5.0     59
3   P004      F     FT   AWS   NaN    8.0    120
4   P005      M     PT    DS   7.0   11.0     58
5   P006      F     PT  None   1.0    NaN     75
6   P007      M     FT    FS   NaN    NaN   None
7   P008      F    NaN    FS  10.0    2.0    136
8   P009      M     PT   NaN  14.0    3.0     60
9   P010      F     FT    DS   NaN    7.0    125
10  P011      M    NaN   AWS   6.0    9.0    NaN

## Filling Missing Values (Imputation)

### Filling Numeric Variables

In [113]:
df

      id gender status  dept   exp  score salary
0   P001      M     FT    DS   2.0    8.0    NaN
1   P002      F     PT    FS   3.0    NaN     54
2   P003      M    NaN   AWS   5.0    5.0     59
3   P004      F     FT   AWS   NaN    8.0    120
4   P005      M     PT    DS   7.0   11.0     58
5   P006      F     PT  None   1.0    NaN     75
6   P007      M     FT    FS   NaN    NaN   None
7   P008      F    NaN    FS  10.0    2.0    136
8   P009      M     PT   NaN  14.0    3.0     60
9   P010      F     FT    DS   NaN    7.0    125
10  P011      M    NaN   AWS   6.0    9.0    NaN

In [114]:
# sabit bir değerle doldurma
df['exp'].fillna(0, inplace = False) # nan değerleri 0 ile doldurdu

0      2.0
1      3.0
2      5.0
3      0.0
4      7.0
5      1.0
6      0.0
7     10.0
8     14.0
9      0.0
10     6.0
Name: exp, dtype: float64

In [115]:
# mean ile doldurma işlemi
df['exp'].mean()

np.float64(6.0)

In [116]:
df['exp'].fillna(df['exp'].mean())

0      2.0
1      3.0
2      5.0
3      6.0
4      7.0
5      1.0
6      6.0
7     10.0
8     14.0
9      6.0
10     6.0
Name: exp, dtype: float64

In [117]:
# median ile doldurma işlemi
df['exp'].median()

5.5

In [118]:
df['exp'].fillna(df['exp'].median())

0      2.0
1      3.0
2      5.0
3      5.5
4      7.0
5      1.0
6      5.5
7     10.0
8     14.0
9      5.5
10     6.0
Name: exp, dtype: float64

In [120]:
df['exp'] # inplace yapmadık o yüzden kalıcı olmadı

0      2.0
1      3.0
2      5.0
3      NaN
4      7.0
5      1.0
6      NaN
7     10.0
8     14.0
9      NaN
10     6.0
Name: exp, dtype: float64

### Filling Categorical Variables

In [121]:
df['dept']

0       DS
1       FS
2      AWS
3      AWS
4       DS
5     None
6       FS
7       FS
8      NaN
9       DS
10     AWS
Name: dept, dtype: object

In [122]:
df['dept'].mode() # en çok tekrar eden department çıktısını verir

0    AWS
1     DS
2     FS
Name: dept, dtype: object

In [123]:
df['dept'].mode()[0] # en çok tekrar eden department çıktısını verir

'AWS'

In [124]:
df['dept'].fillna(df['dept'].mode()[0])

0      DS
1      FS
2     AWS
3     AWS
4      DS
5     AWS
6      FS
7      FS
8     AWS
9      DS
10    AWS
Name: dept, dtype: object

#### bfill(backword fill)

In [126]:
df['dept']

0       DS
1       FS
2      AWS
3      AWS
4       DS
5     None
6       FS
7       FS
8      NaN
9       DS
10     AWS
Name: dept, dtype: object

In [125]:
df['dept'].fillna(method = 'bfill') # bfill yöntemi kendisinden sonra gelen değerle boşlukları doldurur.
# 5. indexten sonra FS geldiği için 5=FS oldu. 8. indexten sonra DS geldiği için 8 = DS yazdı

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      FS
6      FS
7      FS
8      DS
9      DS
10    AWS
Name: dept, dtype: object

#### ffill(forword fill)

In [127]:
df['dept'].fillna(method = 'ffill', inplace = True) # kendinden önceki değer ile doldurur
df['dept'] # inplace = True dediğimiz için kalıcı oldu.

0      DS
1      FS
2     AWS
3     AWS
4      DS
5      DS
6      FS
7      FS
8      FS
9      DS
10    AWS
Name: dept, dtype: object

### Filling by condition & group

In [128]:
df

      id gender status dept   exp  score salary
0   P001      M     FT   DS   2.0    8.0    NaN
1   P002      F     PT   FS   3.0    NaN     54
2   P003      M    NaN  AWS   5.0    5.0     59
3   P004      F     FT  AWS   NaN    8.0    120
4   P005      M     PT   DS   7.0   11.0     58
5   P006      F     PT   DS   1.0    NaN     75
6   P007      M     FT   FS   NaN    NaN   None
7   P008      F    NaN   FS  10.0    2.0    136
8   P009      M     PT   FS  14.0    3.0     60
9   P010      F     FT   DS   NaN    7.0    125
10  P011      M    NaN  AWS   6.0    9.0    NaN

In [130]:
df.loc[df['salary'] >= 100, 'status'] # maaşı 100 ve üzeri olanlar FT çalıştığı görülüyor

3     FT
7    NaN
9     FT
Name: status, dtype: object

In [131]:
df.loc[df['salary'] < 100, 'status'] # maaşı 100 ün altında olanların PT çalıştığı görülüyor

1     PT
2    NaN
4     PT
5     PT
8     PT
Name: status, dtype: object

In [132]:
df.loc[df['salary'] >= 100, 'status'].mode()[0]

'FT'

In [134]:
df.loc[df['salary'] >= 100, 'status'].fillna(df.loc[df['salary'] >= 100, 'status'].mode()[0])
# maaşı 100 ve 100 den büyük olan değerlerin status bilgisi içerisinde en çok tekrar eden değer ile doldurma yaptık

3    FT
7    FT
9    FT
Name: status, dtype: object

In [139]:
df.loc[df['salary'] >= 100, 'status'] = df.loc[df['salary'] >= 100, 'status'].fillna(df.loc[df['salary'] >= 100, 'status'].mode()[0])

In [140]:
df

      id gender status dept   exp  score salary
0   P001      M     FT   DS   2.0    8.0    NaN
1   P002      F     PT   FS   3.0    NaN     54
2   P003      M    NaN  AWS   5.0    5.0     59
3   P004      F     FT  AWS   NaN    8.0    120
4   P005      M     PT   DS   7.0   11.0     58
5   P006      F     PT   DS   1.0    NaN     75
6   P007      M     FT   FS   NaN    NaN   None
7   P008      F     FT   FS  10.0    2.0    136
8   P009      M     PT   FS  14.0    3.0     60
9   P010      F     FT   DS   NaN    7.0    125
10  P011      M    NaN  AWS   6.0    9.0    NaN

In [137]:
df.loc[df['salary'] < 100, 'status'].mode()[0]

'PT'

In [138]:
df.loc[df['salary'] < 100, 'status'].fillna(df.loc[df['salary'] < 100, 'status'].mode()[0])

1    PT
2    PT
4    PT
5    PT
8    PT
Name: status, dtype: object

In [141]:
df.loc[df['salary'] < 100, 'status'] = df.loc[df['salary'] < 100, 'status'].fillna(df.loc[df['salary'] < 100, 'status'].mode()[0])

In [146]:
df

      id gender status dept   exp  score salary
0   P001      M     FT   DS   2.0    8.0    NaN
1   P002      F     PT   FS   3.0    NaN     54
2   P003      M     PT  AWS   5.0    5.0     59
3   P004      F     FT  AWS   NaN    8.0    120
4   P005      M     PT   DS   7.0   11.0     58
5   P006      F     PT   DS   1.0    NaN     75
6   P007      M     FT   FS   NaN    NaN   None
7   P008      F     FT   FS  10.0    2.0    136
8   P009      M     PT   FS  14.0    3.0     60
9   P010      F     FT   DS   NaN    7.0    125
10  P011      M    NaN  AWS   6.0    9.0    NaN

In [147]:
df['status'] # 10 indexteki değerin nan kalmasının sebebi salary sütununda da 10. index nan olduğu için hesaplama yapıp dolduramadı

0      FT
1      PT
2      PT
3      FT
4      PT
5      PT
6      FT
7      FT
8      PT
9      FT
10    NaN
Name: status, dtype: object

In [150]:
df.groupby(['gender','dept'])['status'].apply(lambda x: x.mode()[0])

gender  dept
F       AWS     FT
        DS      FT
        FS      FT
M       AWS     PT
        DS      FT
        FS      FT
Name: status, dtype: object

In [151]:
df.groupby(['gender','dept'])['status'].transform(lambda x: x.mode()[0])

0     FT
1     FT
2     PT
3     FT
4     FT
5     FT
6     FT
7     FT
8     FT
9     FT
10    PT
Name: status, dtype: object

In [152]:
df['status'].fillna(df.groupby(['gender','dept'])['status'].transform(lambda x: x.mode()[0]),inplace = True)

In [153]:
df['status']

0     FT
1     PT
2     PT
3     FT
4     PT
5     PT
6     FT
7     FT
8     PT
9     FT
10    PT
Name: status, dtype: object

In [154]:
df.salary

0      NaN
1       54
2       59
3      120
4       58
5       75
6     None
7      136
8       60
9      125
10     NaN
Name: salary, dtype: object

In [155]:
df

      id gender status dept   exp  score salary
0   P001      M     FT   DS   2.0    8.0    NaN
1   P002      F     PT   FS   3.0    NaN     54
2   P003      M     PT  AWS   5.0    5.0     59
3   P004      F     FT  AWS   NaN    8.0    120
4   P005      M     PT   DS   7.0   11.0     58
5   P006      F     PT   DS   1.0    NaN     75
6   P007      M     FT   FS   NaN    NaN   None
7   P008      F     FT   FS  10.0    2.0    136
8   P009      M     PT   FS  14.0    3.0     60
9   P010      F     FT   DS   NaN    7.0    125
10  P011      M     PT  AWS   6.0    9.0    NaN

In [156]:
df.groupby(['status','dept'])['salary'].transform('mean')

0     125.0
1      57.0
2      59.0
3     120.0
4      66.5
5      66.5
6     136.0
7     136.0
8      57.0
9     125.0
10     59.0
Name: salary, dtype: object

In [157]:
df['salary'].fillna(df.groupby(['status','dept'])['salary'].transform('mean'), inplace = True)

In [158]:
df['salary']

0     125.0
1      54.0
2      59.0
3     120.0
4      58.0
5      75.0
6     136.0
7     136.0
8      60.0
9     125.0
10     59.0
Name: salary, dtype: float64

In [159]:
df

      id gender status dept   exp  score  salary
0   P001      M     FT   DS   2.0    8.0   125.0
1   P002      F     PT   FS   3.0    NaN    54.0
2   P003      M     PT  AWS   5.0    5.0    59.0
3   P004      F     FT  AWS   NaN    8.0   120.0
4   P005      M     PT   DS   7.0   11.0    58.0
5   P006      F     PT   DS   1.0    NaN    75.0
6   P007      M     FT   FS   NaN    NaN   136.0
7   P008      F     FT   FS  10.0    2.0   136.0
8   P009      M     PT   FS  14.0    3.0    60.0
9   P010      F     FT   DS   NaN    7.0   125.0
10  P011      M     PT  AWS   6.0    9.0    59.0

In [166]:
df.groupby(['gender','status'])['exp'].apply('mean')

gender  status
F       FT        10.0
        PT         2.0
M       FT         2.0
        PT         8.0
Name: exp, dtype: float64

In [167]:
df.groupby(['gender','status'])['exp'].transform('mean')

0      2.0
1      2.0
2      8.0
3     10.0
4      8.0
5      2.0
6      2.0
7     10.0
8      8.0
9     10.0
10     8.0
Name: exp, dtype: float64

In [168]:
df['exp'].fillna(df.groupby(['gender','status'])['exp'].transform('mean'), inplace = True)

In [169]:
df['exp']

0      2.0
1      3.0
2      5.0
3     10.0
4      7.0
5      1.0
6      2.0
7     10.0
8     14.0
9     10.0
10     6.0
Name: exp, dtype: float64

In [170]:
df

      id gender status dept   exp  score  salary
0   P001      M     FT   DS   2.0   8.00   125.0
1   P002      F     PT   FS   3.0   7.00    54.0
2   P003      M     PT  AWS   5.0   5.00    59.0
3   P004      F     FT  AWS  10.0   8.00   120.0
4   P005      M     PT   DS   7.0  11.00    58.0
5   P006      F     PT   DS   1.0   7.00    75.0
6   P007      M     FT   FS   2.0   6.25   136.0
7   P008      F     FT   FS  10.0   2.00   136.0
8   P009      M     PT   FS  14.0   3.00    60.0
9   P010      F     FT   DS  10.0   7.00   125.0
10  P011      M     PT  AWS   6.0   9.00    59.0

In [160]:
df.groupby(['status'])['score'].apply('mean')

status
FT    6.25
PT    7.00
Name: score, dtype: float64

In [161]:
df.groupby(['status'])['score'].transform('mean')

0     6.25
1     7.00
2     7.00
3     6.25
4     7.00
5     7.00
6     6.25
7     6.25
8     7.00
9     6.25
10    7.00
Name: score, dtype: float64

In [162]:
df.score.fillna(df.groupby(['status'])['score'].transform('mean'), inplace = True)

In [163]:
df.score

0      8.00
1      7.00
2      5.00
3      8.00
4     11.00
5      7.00
6      6.25
7      2.00
8      3.00
9      7.00
10     9.00
Name: score, dtype: float64

In [164]:
df

      id gender status dept   exp  score  salary
0   P001      M     FT   DS   2.0   8.00   125.0
1   P002      F     PT   FS   3.0   7.00    54.0
2   P003      M     PT  AWS   5.0   5.00    59.0
3   P004      F     FT  AWS   NaN   8.00   120.0
4   P005      M     PT   DS   7.0  11.00    58.0
5   P006      F     PT   DS   1.0   7.00    75.0
6   P007      M     FT   FS   NaN   6.25   136.0
7   P008      F     FT   FS  10.0   2.00   136.0
8   P009      M     PT   FS  14.0   3.00    60.0
9   P010      F     FT   DS   NaN   7.00   125.0
10  P011      M     PT  AWS   6.0   9.00    59.0

In [165]:
df.isna().sum().sum() # df te nan 0 tane olduğunu gördük

np.int64(3)